10-AsyncWeb/Apache bench test - with blocking programming.txt
// Simulate a BAD access to (e.g.) a DB
    Thread.Sleep(1000); // BAD because it blocks the execution
    Task.Delay(1000).Wait(); // BAD because it blocks the execution 

D:\Courses\C# - HTL leonding\Programas\apache\Apache24\bin>ab -n 1000 -c 200 http://localhost:5119/
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        Kestrel
Server Hostname:        localhost
Server Port:            5119

Document Path:          /
Document Length:        12 bytes

Concurrency Level:      200
Time taken for tests:   59.322 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      104000 bytes
HTML transferred:       12000 bytes
Requests per second:    16.86 [#/sec] (mean)
Time per request:       11864.438 [ms] (mean)
Time per request:       59.322 [ms] (mean, across all concurrent requests)
Transfer rate:          1.71 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.5      0       1
Processing:  2104 10649 3078.3  10215   17800
Waiting:     2035 10647 3078.5  10215   17793
Total:       2105 10650 3078.3  10216   17801

Percentage of the requests served within a certain time (ms)
  50%  10216
  66%  11048
  75%  12411
  80%  13920
  90%  14725
  95%  15671
  98%  16684
  99%  17791
 100%  17801 (longest request)

D:\Courses\C# - HTL leonding\Programas\apache\Apache24\bin>